<template>
  <!--这边要绑定才有效-->
  <ve-histogram height="700px" width="1000px" :grid="grid" :title="title" legend-visible="true" :colors="colors" :data="chartData" :toolbox="toolbox" :settings="chartSettings" :extend="extend"></ve-histogram>

</template>

<script>
  export default {
    data () {
      this.grid = {
        show: true,
        backgroundColor: '#aaccad',
        borderColor: '#00c99c'
      };

      // 自己定义setting
      this.chartSettings = {
        showLine: ['第一阶段体重','第二阶段体重'],
        // 指定某指标坐在的轴，没指定的都默认在左边
        // 注意，如果有多个就要用数组的形式，用原本的而不是stack
        axisSite: {right: ['跑步','HIIT+拉伸']},
        yAxisType: ['KMB', 'KMB'],
        yAxisName: ['体重(Kg)', '运动(m)'],
        // 我上面指定了，应该就没啥用了
        metrics: ['第一阶段体重','第二阶段体重', '跑步', 'HIIT+拉伸'],
        // 设置为true就不用从0开始了，不然就从0开始
        // scale: [true, true, true],
        // 设横轴为时间
        xAxisType: 'time',
        min: [75,0],
        max: [105,80],
        // 堆到一起
        stack: {'用户': ['跑步', 'HIIT+拉伸']}
      };
      this.title = {
        name:"主题"
      };
      // 修改颜色
      this.colors = ['#369be2', '#1038e2', '#4e9e74', '#de9213'];
      // 添加工具箱
      this.toolbox = {
        feature: {
          saveAsImage: {}
        }
      };
      this.extend = {
        series: {
          label: {
            normal: {
              show: true
            }
          }
        },
        // 标题设置
        title: {
          text: '第一阶段: 200-180 , 第二阶段: 180-160',
          x: 'middle',
          y: 'bottom',
          textAlign: 'center'
        }
      };
      return {
        chartData: {
          // 第一个参数是底标
          columns: ['日期', '第一阶段体重', '第二阶段体重','跑步', 'HIIT+拉伸'],
          rows: [
            { '日期': '2020-6-12', '第一阶段体重': 100.1, '跑步': 0 ,'HIIT+拉伸': 0  },
            { '日期': '2020-7-21', '第一阶段体重': 96.5,  '跑步': 49,'HIIT+拉伸': 0  },
            { '日期': '2020-7-22', '第一阶段体重': 96.0,  '跑步': 50,'HIIT+拉伸': 0  },
            { '日期': '2020-7-23', '第一阶段体重': 95.5,  '跑步': 36,'HIIT+拉伸': 5  },
            { '日期': '2020-7-24', '第一阶段体重': 94.8,  '跑步': 7 ,'HIIT+拉伸': 0  },
            { '日期': '2020-7-25', '第一阶段体重': 94.4,  '跑步': 52,'HIIT+拉伸': 5  },
            { '日期': '2020-7-26', '第一阶段体重': 93.85, '跑步': 40,'HIIT+拉伸': 5  },
            { '日期': '2020-7-27', '第一阶段体重': 93.45, '跑步': 55,'HIIT+拉伸': 5  },
            { '日期': '2020-7-28', '第一阶段体重': 93.1,  '跑步': 38,'HIIT+拉伸': 5  },
            { '日期': '2020-7-29', '第一阶段体重': 92.9,  '跑步': 54,'HIIT+拉伸': 5  },
            { '日期': '2020-7-30', '第一阶段体重': 92.7,  '跑步': 15,'HIIT+拉伸': 0  },
            { '日期': '2020-7-31', '第一阶段体重': 93.45, '跑步': 28,'HIIT+拉伸': 11  },
            { '日期': '2020-8-1',  '第一阶段体重': 92.5,  '跑步': 18,'HIIT+拉伸': 6  },
            { '日期': '2020-8-2',  '第一阶段体重': 91.85, '跑步': 7 ,'HIIT+拉伸': 6  },
            { '日期': '2020-8-3',  '第一阶段体重': 91.55, '跑步': 28,'HIIT+拉伸': 12  },
            { '日期': '2020-8-4',  '第一阶段体重': 91.95, '跑步': 23,'HIIT+拉伸': 0  },
            { '日期': '2020-8-5',  '第一阶段体重': 91.7,  '跑步': 0, 'HIIT+拉伸': 31  },
            { '日期': '2020-8-6',  '第一阶段体重': 92.8,  '跑步': 0 ,'HIIT+拉伸': 0  },
            { '日期': '2020-8-7',  '第一阶段体重': 91.95, '跑步': 16,'HIIT+拉伸': 22  },
            { '日期': '2020-8-8',  '第一阶段体重': 91.0,  '跑步': 21,'HIIT+拉伸': 24  },
            { '日期': '2020-8-9',  '第一阶段体重': 90.6,  '跑步': 21,'HIIT+拉伸': 26  },
            { '日期': '2020-8-10', '第一阶段体重': 90.45, '跑步': 22,'HIIT+拉伸': 10  },
            { '日期': '2020-8-11', '第一阶段体重': 89.95, '跑步': 20,'HIIT+拉伸': 26  },
            { '日期': '2020-8-12', '第二阶段体重': 89.5,  '跑步': 33,'HIIT+拉伸': 28  },
            { '日期': '2020-8-13', '第二阶段体重': 91.25,  '跑步': 0, 'HIIT+拉伸': 0  },
            { '日期': '2020-8-14', '第二阶段体重': 91.00,  '跑步': 29, 'HIIT+拉伸': 27  },
            { '日期': '2020-8-15', '第二阶段体重': 89.25,  '跑步': 23,'HIIT+拉伸': 30  },
            { '日期': '2020-8-16', '第二阶段体重': 88.60,  '跑步': 23,'HIIT+拉伸': 28  },
            { '日期': '2020-8-17', '第二阶段体重': 88.55,  '跑步': 0,'HIIT+拉伸': 0  },
            { '日期': '2020-8-18', '第二阶段体重': 88.45,  '跑步': 0,'HIIT+拉伸': 41  },
            { '日期': '2020-8-19', '第二阶段体重': 88.00,  '跑步': 26,'HIIT+拉伸': 44  },
            { '日期': '2020-8-20', '第二阶段体重': 87.80,  '跑步': 0,'HIIT+拉伸': 0  },
            { '日期': '2020-8-21', '第二阶段体重': 88.75,  '跑步': 0,'HIIT+拉伸': 33  },
            { '日期': '2020-8-22', '第二阶段体重': 88.35,  '跑步': 33,'HIIT+拉伸': 11  },
            { '日期': '2020-8-22', '第二阶段体重': 87.85,  '跑步': 0,'HIIT+拉伸': 0  },

          ]
        }
      }
    }
  }
</script>

<style>

</style>
